In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Customers (customer_id int, name varchar(20), visited_on date, amount int)

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('1', 'Jhon', '2019-01-01', '100')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('2', 'Daniel', '2019-01-02', '110')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('3', 'Jade', '2019-01-03', '120')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('4', 'Khaled', '2019-01-04', '130')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('5', 'Winston', '2019-01-05', '110')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('6', 'Elvis', '2019-01-06', '140')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('7', 'Anna', '2019-01-07', '150')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('8', 'Maria', '2019-01-08', '80')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('9', 'Jaze', '2019-01-09', '110')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('1', 'Jhon', '2019-01-10', '130')

In [ ]:
insert into Customers (customer_id, name, visited_on, amount) values ('3', 'Jade', '2019-01-10', '150')

In [ ]:
select * from customers

+-------------+---------+------------+--------+
| customer_id | name    | visited_on | amount |
+-------------+---------+------------+--------+
| 1           | Jhon    | 2019-01-01 | 100    |
+-------------+---------+------------+--------+
| 2           | Daniel  | 2019-01-02 | 110    |
+-------------+---------+------------+--------+
| 3           | Jade    | 2019-01-03 | 120    |
+-------------+---------+------------+--------+
| 4           | Khaled  | 2019-01-04 | 130    |
+-------------+---------+------------+--------+
| 5           | Winston | 2019-01-05 | 110    |
+-------------+---------+------------+--------+
| 6           | Elvis   | 2019-01-06 | 140    |
+-------------+---------+------------+--------+
| 7           | Anna    | 2019-01-07 | 150    |
+-------------+---------+------------+--------+
| 8           | Maria   | 2019-01-08 | 80     |
+-------------+---------+------------+--------+
| 9           | Jaze    | 2019-01-09 | 110    |
+-------------+---------+------------+--------+
| 1           | Jhon    | 2019-01-10 | 130    |
+-------------+---------+------------+--------+
| 3           | Jade    | 2019-01-10 | 150    |
+-------------+---------+------------+--------+

## Compute the moving average of how much the customer paid in a seven days window (i.e., current day + 6 days before). average_amount should be rounded to two decimal places.

In [ ]:
select visited_on, sum(amount) from customers group by visited_on

+------------+-------------+
| visited_on | sum(amount) |
+------------+-------------+
| 2019-01-01 | 100         |
+------------+-------------+
| 2019-01-02 | 110         |
+------------+-------------+
| 2019-01-03 | 120         |
+------------+-------------+
| 2019-01-04 | 130         |
+------------+-------------+
| 2019-01-05 | 110         |
+------------+-------------+
| 2019-01-06 | 140         |
+------------+-------------+
| 2019-01-07 | 150         |
+------------+-------------+
| 2019-01-08 | 80          |
+------------+-------------+
| 2019-01-09 | 110         |
+------------+-------------+
| 2019-01-10 | 280         |
+------------+-------------+

In [ ]:
select visited_on, sum(amount) over (order by visited_on) cumsum
    from (select visited_on, sum(amount) amount from customers group by visited_on)

+------------+--------+
| visited_on | cumsum |
+------------+--------+
| 2019-01-01 | 100    |
+------------+--------+
| 2019-01-02 | 210    |
+------------+--------+
| 2019-01-03 | 330    |
+------------+--------+
| 2019-01-04 | 460    |
+------------+--------+
| 2019-01-05 | 570    |
+------------+--------+
| 2019-01-06 | 710    |
+------------+--------+
| 2019-01-07 | 860    |
+------------+--------+
| 2019-01-08 | 940    |
+------------+--------+
| 2019-01-09 | 1050   |
+------------+--------+
| 2019-01-10 | 1330   |
+------------+--------+

In [ ]:
select date(min(visited_on),'-1 day') as visited_on, 0 as cumsum from customers
    union
select visited_on, sum(amount) over (order by visited_on) cumsum
    from (select visited_on, sum(amount) amount from customers group by visited_on)

+------------+--------+
| visited_on | cumsum |
+------------+--------+
| 2018-12-31 | 0      |
+------------+--------+
| 2019-01-01 | 100    |
+------------+--------+
| 2019-01-02 | 210    |
+------------+--------+
| 2019-01-03 | 330    |
+------------+--------+
| 2019-01-04 | 460    |
+------------+--------+
| 2019-01-05 | 570    |
+------------+--------+
| 2019-01-06 | 710    |
+------------+--------+
| 2019-01-07 | 860    |
+------------+--------+
| 2019-01-08 | 940    |
+------------+--------+
| 2019-01-09 | 1050   |
+------------+--------+
| 2019-01-10 | 1330   |
+------------+--------+

In [ ]:
with t as (
    select date(min(visited_on),'-1 day') as visited_on, 0 as cumsum from customers
    union
    select visited_on, sum(amount) over (order by visited_on) cumsum
    from (select visited_on, sum(amount) amount from customers group by visited_on)
)

select t1.visited_on, (t1.cumsum-t2.cumsum) amount, round(1.*(t1.cumsum-t2.cumsum)/7,2) average_amount
    from t t1 join t t2 on t1.visited_on=date(t2.visited_on,'+7 days')

+------------+--------+----------------+
| visited_on | amount | average_amount |
+------------+--------+----------------+
| 2019-01-07 | 860    | 122.86         |
+------------+--------+----------------+
| 2019-01-08 | 840    | 120.0          |
+------------+--------+----------------+
| 2019-01-09 | 840    | 120.0          |
+------------+--------+----------------+
| 2019-01-10 | 1000   | 142.86         |
+------------+--------+----------------+